Revit 2027 API
TextNoteOptions Constructor
Overload List
Name | Description
TextNoteOptions() |  Default constructor; populates the options with their respective default values.
TextNoteOptions(ElementId) |  Constructs text options to create text of the given type.
Top
See Also
Reference
TextNoteOptions Class
Autodesk.Revit.DB Namespace